Test_Edo/o-rig_blockMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

//================== Macros definition ================

R	2;	// Radius of the circle/tube
theta	0;	// Rotation angle of the external blocks of the mesh (leave it to 0 except for very strange case like swirl)
zmin	0;	// Minimum z coordinate
zmax	1;	// Maximum z coordinate

// Coordinates of the 0 block : The central square
l	0.666;
xmin 	#calc "-1*$l";	// -1;
xmax	$l;		// 1;
ymin	#calc "-1*$l";	// -1;
ymax	$l;		// 1;

// Coordinates of the vertex of the external blocks
// Vertex are ordered counter-clockwise, beginning from the top-right corner
v1x	#calc "$R*cos(degToRad($theta+45))";
v1y	#calc "$R*sin(degToRad($theta+45))";
v2x     #calc "$R*cos(degToRad($theta+135))";
v2y     #calc "$R*sin(degToRad($theta+135))";
v3x     #calc "$R*cos(degToRad($theta+225))";
v3y     #calc "$R*sin(degToRad($theta+225))";
v4x     #calc "$R*cos(degToRad($theta+315))";
v4y     #calc "$R*sin(degToRad($theta+315))";

// Coordinates of the interpolation points for the external blocks
// Points are ordered counter-clockwise beginning from the top-one
p1x     #calc "$R*cos(degToRad($theta+90))";
p1y     #calc "$R*sin(degToRad($theta+90))";
p2x     #calc "$R*cos(degToRad($theta+180))";
p2y     #calc "$R*sin(degToRad($theta+180))";
p3x     #calc "$R*cos(degToRad($theta+270))";
p3y     #calc "$R*sin(degToRad($theta+270))";
p4x     #calc "$R*cos(degToRad($theta+360))";
p4y     #calc "$R*sin(degToRad($theta+360))";


//==================== Vertex definition =============

vertices
(
    // Block 0: central square
    (	$xmin 	$ymin 	$zmin	)		// 0
    (	$xmax 	$ymin 	$zmin	)		// 1
    (	$xmax 	$ymax 	$zmin	)		// 2
    (	$xmin 	$ymax 	$zmin	)		// 3
    (	$xmin 	$ymin 	$zmax	)		// 4
    (	$xmax 	$ymin 	$zmax	)		// 5 
    (	$xmax 	$ymax 	$zmax	)		// 6
    (	$xmin 	$ymax 	$zmax	)		// 7
    // External blocks vertices
    (	$v3x	$v3y	$zmin	)		// 8
    (	$v4x	$v4y	$zmin	)		// 9
    (	$v1x	$v1y	$zmin	)		// 10
    (	$v2x	$v2y	$zmin	)		// 11
    (	$v3x	$v3y	$zmax	)		// 12
    (	$v4x	$v4y	$zmax	)		// 13
    (	$v1x	$v1y	$zmax	)		// 14
    (	$v2x	$v2y	$zmax	)		// 15

);

blocks
(
    hex (0 1 2 3 4 5 6 7)	(20 20 1) 	simpleGrading (1 1 1)	// 0: central square
    hex (1 9 10 2 5 13 14 6)	(20 20 1)	simpleGrading (1 1 1)	// 1: external right
    hex (3 2 10 11 7 6 14 15)	(20 20 1)	simpleGrading (1 1 1)	// 2: extrenal top
    hex (8 0 3 11 12 4 7 15)	(20 20 1)	simpleGrading (1 1 1)	// 3: external left
    hex (8 9 1 0 12 13 5 4)	(20 20 1)	simpleGrading (1 1 1)	// 4: external bottom


);

edges
(
    arc 8 9 	(	$p3x 	$p3y 	$zmin	)
    arc 9 10	(	$p4x	$p4y	$zmin	)
    arc 10 11	(	$p1x	$p1y	$zmin	)
    arc 11 8	(	$p2x	$p2y	$zmin	)
    arc 12 13   (       $p3x    $p3y    $zmax   )
    arc 13 14	(       $p4x    $p4y    $zmax   )
    arc 14 15   (       $p1x    $p1y    $zmax   )
    arc 15 12   (       $p2x    $p2y    $zmax   )
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
	 	(1 1)
		(2 3)
		(3 0)
		(4 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
	 	(0 4)
		(0 5)
		(1 4)
		(1 5)
		(2 4)
		(2 5)
		(3 4)
		(3 5)
		(4 4)
		(4 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
